01  WS-AREA-1 PIC X(10). 01 WS-AREA-2 PIC 9(7) VALUE ZEROES.  

PROCEDURE DIVISION.

    MOVE 'Hello' TO WS-AREA-1.
    DISPLAY WS-AREA-1.
    ADD 1 TO WS-AREA-2.
    DISPLAY WS-AREA-2.
    GOBACK.